recipes/curried-chickpea-and-quinoa.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Curried Chickpea and Quinoa</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Curried Chickpea and Quinoa</h1>
<p>
<a href="https://naturallyella.com/curried-chickpea-bowls/">Original link</a>
</p>

<div id="outline-container-org40caf16" class="outline-2">
<h2 id="org40caf16">Ingredients</h2>
<div class="outline-text-2" id="text-org40caf16">
</div>
<div id="outline-container-orgfd7a4ef" class="outline-3">
<h3 id="orgfd7a4ef">Chickpeas</h3>
<div class="outline-text-3" id="text-orgfd7a4ef">
<ul class="org-ul">
<li>2 teaspoons olive oil</li>
<li>2 shallots, minced</li>
<li>2 cloves garlic, minced</li>
<li>1 tablespoon curry powder</li>
<li>1/2 cup cream or coconut milk</li>
<li>2 cups chickpeas</li>
<li>Vegetable broth, as needed</li>
<li>Salt, as needed</li>
</ul>
</div>
</div>

<div id="outline-container-org0735a94" class="outline-3">
<h3 id="org0735a94">Serving</h3>
<div class="outline-text-3" id="text-org0735a94">
<ul class="org-ul">
<li>1 cup cooked quinoa</li>
<li>2 tablespoons parsley</li>
<li>1 to 2 tablespoons lemon juice</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org46eb68f" class="outline-2">
<h2 id="org46eb68f">Method</h2>
<div class="outline-text-2" id="text-org46eb68f">
<ol class="org-ol">
<li>Heat a pot or dutch oven over medium-low heat. Add the shallot and cook for 3 to 4 minutes, until soft and fragrant. Stir in the garlic, cooking for another 1 to 2 minutes. Add the curry powder, followed by the cream or coconut milk.</li>
<li>Add the chickpeas and a splash of vegetable broth or water. Cook on low until the chickpeas are hot and tender, 6 to 8 minutes. If needed, add a splash or two of vegetable broth of coconut milk.</li>
<li>Serve the curried chickpeas over the quinoa and sprinkle with parsley/feta. Serve with lemon wedges if desired.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
